spec/fixtures/invoices/show-200-taxed.xml

HTTP/1.1 200 OK
Content-Type: application/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?>
<invoice href="https://api.recurly.com/v2/invoices/created-invoice">
  <account href="https://api.recurly.com/v2/accounts/abcdef1234567890"/>
  <uuid>created-invoice</uuid>
  <state>open</state>
  <invoice_number type="integer">1000</invoice_number>
  <po_number nil="nil"></po_number>
  <vat_number nil="nil"></vat_number>
  <subtotal_in_cents type="integer">300</subtotal_in_cents>
  <tax_in_cents type="integer">100</tax_in_cents>
  <total_in_cents type="integer">300</total_in_cents>
  <currency>USD</currency>
  <created_at type="datetime">2011-04-30T08:00:00Z</created_at>
  <tax_type>usst</tax_type>
  <line_items>
    <adjustment href="https://api.recurly.com/v2/adjustments/charge" type="charge">
      <account href="https://api.recurly.com/v2/accounts/abcdef1234567890"/>
      <invoice href="https://api.recurly.com/v2/invoices/created-invoice"/>
      <uuid>charge</uuid>
      <state>invoiced</state>
      <description>Special charge</description>
      <origin>one_time</origin>
      <unit_amount_in_cents type="integer">300</unit_amount_in_cents>
      <quantity type="integer">1</quantity>
      <discount_in_cents type="integer">0</discount_in_cents>
      <tax_in_cents type="integer">100</tax_in_cents>
      <total_in_cents type="integer">300</total_in_cents>
      <currency>USD</currency>
      <taxable type="boolean">false</taxable>
      <start_date nil="nil"></start_date>
      <end_date nil="nil"></end_date>
      <created_at type="datetime">2011-04-30T08:00:00Z</created_at>
    </adjustment>
  </line_items>
  <transactions>
    <transaction href="https://api.recurly.com/v2/transactions/transaction" type="credit_card">
      <account href="https://api.recurly.com/v2/accounts/abcdef1234567890"/>
      <invoice href="https://api.recurly.com/v2/invoices/created-invoice"/>
      <uuid>transaction</uuid>
      <action>purchase</action>
      <amount_in_cents type="integer">300</amount_in_cents>
      <tax_in_cents type="integer">0</tax_in_cents>
      <currency>USD</currency>
      <status>success</status>
      <reference nil="nil"></reference>
      <recurring type="boolean">false</recurring>
      <test type="boolean">true</test>
      <voidable type="boolean">true</voidable>
      <refundable type="boolean">true</refundable>
      <cvv_result code="" nil="nil"></cvv_result>
      <avs_result code="" nil="nil"></avs_result>
      <avs_result_street nil="nil"></avs_result_street>
      <avs_result_postal nil="nil"></avs_result_postal>
      <created_at type="datetime">2011-04-30T08:00:00Z</created_at>
      <details>
        <account>
          <account_code>abcdef1234567890</account_code>
          <first_name>Lucille</first_name>
          <last_name>Bluth</last_name>
          <company nil="nil"></company>
          <email>lucille@bluth-company.com</email>
          <billing_info type="credit_card">
            <first_name>George</first_name>
            <last_name>Bluth</last_name>
            <address1 nil="nil"></address1>
            <address2 nil="nil"></address2>
            <city nil="nil"></city>
            <state nil="nil"></state>
            <zip nil="nil"></zip>
            <country nil="nil"></country>
            <phone nil="nil"></phone>
            <vat_number nil="nil"></vat_number>
            <card_type>Visa</card_type>
            <year type="integer">2014</year>
            <month type="integer">1</month>
            <first_six>411111</first_six>
            <last_four>1111</last_four>
          </billing_info>
        </account>
      </details>
      <a name="refund" href="https://api.recurly.com/v2/transactions/transaction" method="delete"/>
    </transaction>
  </transactions>
</invoice>
